ugi/001.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Upper GI 001</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://alzzza.github.io/assets/css/main.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Upper GI 001</h1>
<p>
<a href="https://github.com/alzzza/alzzza.github.io/edit/main/src/ugi/001.org">Edit</a>
</p>

<p>
<a href="./index.html">Home</a>
</p>

<p>
<a href="./002.html">Next page &gt;&gt;</a>
</p>

<hr />

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org50a8e75">Oesophagectomy</a>
<ul>
<li><a href="#orgac0cd4a">The oOOOooOoOoOOooOOOooooOOoOesophagus</a></li>
<li><a href="#orgb0d2db7">Cancer of the oesophagus</a></li>
<li><a href="#org2fe1dd7">Modified Ivor-Lewis Esophagogastrectomy</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org50a8e75" class="outline-2">
<h2 id="org50a8e75">Oesophagectomy</h2>
<div class="outline-text-2" id="text-org50a8e75">
<p>
Created: 2025-04-28 - Updated: 2025-04-28
</p>
</div>

<div id="outline-container-orgac0cd4a" class="outline-3">
<h3 id="orgac0cd4a">The oOOOooOoOoOOooOOOooooOOoOesophagus</h3>
<div class="outline-text-3" id="text-orgac0cd4a">
<ul class="org-ul">
<li>The oesophagus is a hollow, muscular tube lined by squamous epithelium.</li>
<li>25 cm long.</li>
<li>It connects the hypopharynx to the stomach.</li>
<li>Runs from the cricopharyngeal muscle (upper oesophageal sphincter) at C6 to about 2 cm below the diaphragm, where it joins the stomach.</li>
</ul>
</div>

<div id="outline-container-orgabca939" class="outline-4">
<h4 id="orgabca939">Structure</h4>
<div class="outline-text-4" id="text-orgabca939">
<ul class="org-ul">
<li>Has inner circular and outer longitudinal muscle layers. The upper third is striated muscle, the lower two-thirds is smooth muscle. The lower 4-6 cm forms the lower oesophageal sphincter with thickened smooth muscle.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd03136e" class="outline-4">
<h4 id="orgd03136e">Histology</h4>
<div class="outline-text-4" id="text-orgd03136e">
<ul class="org-ul">
<li>Lined by stratified squamous epithelium, continuous with oral and pharyngeal mucosa. At the oesophagogastric junction, the lining abruptly changes to columnar epithelium at the "Z line." About one-third of people have small patches of columnar epithelium within the squamous lining.</li>
<li>Submucosa contains scattered mucous glands secreting into the lumen.</li>
</ul>
</div>
</div>

<div id="outline-container-org6f8c9ac" class="outline-4">
<h4 id="org6f8c9ac">Relations</h4>
<div class="outline-text-4" id="text-org6f8c9ac">
<ul class="org-ul">
<li>In the thorax, the oesophagus is vertical and posterior, behind the trachea and heart, then deviates left behind the left bronchus and atrium. Indented by the aortic arch, crossed by the azygos vein, and parallels the descending aorta before passing through the diaphragm.</li>
<li>Passes through the oesophageal hiatus, surrounded by diaphragmatic crura, and anchored by the phrenooesophageal ligament, with surrounding loose connective tissue.</li>
</ul>
</div>
</div>

<div id="outline-container-org72c2d87" class="outline-4">
<h4 id="org72c2d87">Junction with Stomach</h4>
<div class="outline-text-4" id="text-org72c2d87">
<ul class="org-ul">
<li>Last 2 cm is intra-abdominal before joining the stomach at an acute angle (angle of His), marked by puckered gastric mucosa and a U-shaped gastric muscle sling.</li>
</ul>
</div>
</div>

<div id="outline-container-org6c6be0c" class="outline-4">
<h4 id="org6c6be0c">Blood Supply</h4>
<div class="outline-text-4" id="text-org6c6be0c">
<ul class="org-ul">
<li>Receives segmental arterial supply from inferior thyroid, aorta, intercostal, tracheobronchial, and inferior phrenic arteries, plus submucosal gastric arteries.</li>
<li>Venous drainage parallels arteries, mainly via azygos and hemiazygos veins.</li>
<li>Submucosal veins connect portal and systemic systems.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd18a46a" class="outline-4">
<h4 id="orgd18a46a">Lymphatic Drainage</h4>
<div class="outline-text-4" id="text-orgd18a46a">
<ul class="org-ul">
<li>Lymphatics run longitudinally, draining to perioesophageal nodes in neck, mediastinum, and abdomen.</li>
</ul>
</div>
</div>

<div id="outline-container-org0c221ee" class="outline-4">
<h4 id="org0c221ee">Innervation</h4>
<div class="outline-text-4" id="text-org0c221ee">
<ul class="org-ul">
<li>Innervated by sympathetic and parasympathetic fibres (mainly vagus). Recurrent laryngeal nerves supply the upper sphincter and upper third. Vagal trunks run alongside, form a plexus in the middle third, then reunite as anterior and posterior trunks through the hiatus to the stomach.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb0d2db7" class="outline-3">
<h3 id="orgb0d2db7">Cancer of the oesophagus</h3>
<div class="outline-text-3" id="text-orgb0d2db7">
<ul class="org-ul">
<li>About half of oesophageal cancers are found at the oesophagogastric junction (OGJ).</li>
<li>Most cancers at the cardia (around 90%) are adenocarcinomas. These usually start in the stomach lining and then extend up into the lower oesophagus, rather than being true oesophageal cancers.</li>
<li>Exact causes are still unclear. There are some links to hiatal hernia, reflux oesophagitis, Barrett's oesophagus, previous gastric surgery, or achalasia, but in many cases, the reason isn't obvious.</li>
<li>Alcohol and tobacco use are common in affected patients.</li>
</ul>
</div>

<div id="outline-container-org2e4088f" class="outline-4">
<h4 id="org2e4088f">Clinical Features</h4>
<div class="outline-text-4" id="text-org2e4088f">
<ul class="org-ul">
<li>Symptoms often don't appear until there's some blockage in the oesophagus.</li>
<li>The most common sign is progressive difficulty swallowing - starting with solids and sometimes progressing to liquids. Painful swallowing (odynophagia) can also occur.</li>
<li>Pain in the upper abdomen may be felt and can radiate to the back or around the ribs.</li>
<li>This cancer can mimic other conditions such as achalasia, so early endoscopy and biopsy are important for anyone with new swallowing issues.</li>
<li>Occasionally, it's picked up due to anaemia or gastrointestinal bleeding.</li>
<li>Diagnosis isn't always straightforward; sometimes it's only confirmed during or after surgery.</li>
</ul>
</div>
</div>

<div id="outline-container-org7dc6377" class="outline-4">
<h4 id="org7dc6377">Surgical Strategies</h4>
<div class="outline-text-4" id="text-org7dc6377">
<ul class="org-ul">
<li>Imaging and endoscopy usually provide the diagnosis and help define the extent of disease before surgery.</li>
<li>Cancers are classified by location:
<ol class="org-ol">
<li>Mainly oesophageal (supra Z-line)</li>
<li>Centred at the OGJ (Z-line)</li>
<li>Mainly gastric (infra Z-line)</li>
<li>Extensive disease (rarely operable; may require total oesophagogastrectomy)</li>
</ol></li>
<li>Surgical goals are to remove the tumour, relieve obstruction, and maintain as much normal digestion as possible.</li>
<li>The main operations are Ivor-Lewis oesophagogastrectomy and total gastrectomy with Roux-Y reconstruction.</li>
</ul>
</div>
</div>

<div id="outline-container-org56eddf6" class="outline-4">
<h4 id="org56eddf6">Patient Selection</h4>
<div class="outline-text-4" id="text-org56eddf6">
<ul class="org-ul">
<li>Surgery is considered only if there's no evidence of distant spread (like to the liver, brain, lungs, or lymph nodes).</li>
<li>CT scans aren't always reliable for determining if surgery is possible; direct exploration is often needed.</li>
<li>If surgery isn't an option, a palliative oesophageal tube may help with swallowing.</li>
<li>For tumours mainly in the stomach, where tubes aren't suitable, a gastrostomy or jejunostomy might allow patients to spend more time at home, though it doesn't improve swallowing or survival.</li>
<li>Choosing an operation depends on tumour location, patient health, and other factors.</li>
</ul>
</div>
</div>

<div id="outline-container-org2f28ec4" class="outline-4">
<h4 id="org2f28ec4">Prognosis</h4>
<div class="outline-text-4" id="text-org2f28ec4">
<ul class="org-ul">
<li>Long-term survival is limited - about 20% reach five years after surgery, so most operations are sadly palliative.</li>
<li>Surgical palliation can help restore swallowing, but if the operation isn't planned carefully, digestive problems can result.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2fe1dd7" class="outline-3">
<h3 id="org2fe1dd7">Modified Ivor-Lewis Esophagogastrectomy</h3>
<div class="outline-text-3" id="text-org2fe1dd7">
<ul class="org-ul">
<li>Used for cancers at or just above the Z-line (lower oesophagus and cardia).</li>
<li>Two main phases:
<ul class="org-ul">
<li>Abdominal phase: Assess tumour, mobilise stomach, prepare for reconstruction.</li>
<li>Thoracic phase: Remove lower oesophagus and upper stomach, reconstruct.</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgfefdd76" class="outline-4">
<h4 id="orgfefdd76">Abdominal Phase (patient supine)</h4>
<div class="outline-text-4" id="text-orgfefdd76">
<ul class="org-ul">
<li>Incision: Upper midline, possibly extended upwards for better access.</li>
<li>Expose left upper quadrant: Retract left costal arch, surgeon stands on patient's right.
<ol class="org-ol">
<li>Divide triangular ligament of liver's left lobe, retract liver medially.</li>
<li>Clamp, divide, ligate upper gastrohepatic omentum.</li>
<li>Encircle distal oesophagus and vagi with <a href="https://my.clevelandclinic.org/health/articles/penrose-drain">Penrose drain</a>; bluntly mobilise oesophagus, check tumour mobility and resectability.</li>
<li>Mobilise stomach by dividing gastrocolic omentum outside gastroepiploic arcade, preserving right gastroepiploic vessels.</li>
<li>Splenectomy (for distal oesophageal malignancy); control splenic vessels at hilum.</li>
<li>Encircle splenic hilum, divide and ligate splenic vessels distal to pancreas tail.</li>
<li>Divide short gastric vessels, free gastric fundus from diaphragm.</li>
<li>Perform Heineke-Mikulicz pyloroplasty (Weinberg modification) to aid gastric emptying post-vagotomy.</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-orge6e157e" class="outline-4">
<h4 id="orge6e157e">Thoracic Phase (patient left lateral, right thoracotomy)</h4>
<div class="outline-text-4" id="text-orge6e157e">
<ul class="org-ul">
<li>Incision: Right midthoracic, enter pleural space via 5th interspace.</li>
<li>Expose oesophagus: Retract right lung, incise mediastinal pleura, leave strip attached to oesophagus.</li>
<li>Mobilise oesophagus: Encircle with Penrose drain, mobilise with lymph nodes from posterior mediastinum.</li>
<li>Transect oesophagus: Just below azygos vein (using non-crushing clamp and scalpel).</li>
<li>Draw stomach into chest: Through oesophageal hiatus.</li>
<li>Transect stomach: At least 4 cm from tumour, clamp and divide vessels of lesser and greater curvature.</li>
<li>Tailor stomach: Staple lesser curvature, excise excess tissue, preserve right gastroepiploic vessels.</li>
<li>Anastomosis: End-to-end between stomach and oesophagus; use silk sutures (horizontal on stomach, vertical on oesophagus), running lock stitch for mucosa, Maloney dilator to ensure lumen size.</li>
<li>Secure stomach: Suture to mediastinal pleura to reduce tension.</li>
<li>Insert NG tube.</li>
</ul>
</div>
</div>

<div id="outline-container-org1e3576d" class="outline-4">
<h4 id="org1e3576d">Post-operative Care</h4>
<div class="outline-text-4" id="text-org1e3576d">
<ul class="org-ul">
<li>Straight after surgery, patients go to ICU.</li>
<li>Urinary catheter stays in for 4-5 days.</li>
<li>Broad-spectrum antibiotics are given before and after surgery for about 4-5 days.</li>
<li>We start parenteral (IV) nutrition the morning after surgery and keep it going until you can eat normally by mouth.</li>
<li>Cimetidine is given intravenously until you're back on a regular diet, to protect the stomach lining.</li>
<li>Dressings come off the day after surgery.</li>
<li>Chest tubes (one on each side) are removed as soon as there's no more drainage or air leak. Sometimes they are kept in until the patient returns to full diet (to ensure that there is no chyle leak).</li>
<li>Daily chest X-rays help us keep track of your recovery.</li>
<li>By day 5 or 6, we look for signs bowel activity - if so, we do a Gastrografin swallow X-ray to check the join (anastomosis) for leaks and make sure everything's open.</li>
<li>If there's no leak, you start with clear liquids by mouth, then move to a normal diet over the next 3 days. IV nutrition is gradually stopped.</li>
<li>If a leak is found on the X-ray, feeding by mouth is stopped - we use a NG tube for stomach suction and continue IV nutrition (2,000-3,000 calories/day). Wait 2 weeks, then check again. If still leaking, IV nutrition continues for up to 3 weeks.</li>
<li>Most patients are in hospital for 10-14 days if all goes well.</li>
<li>Early satiety and weight loss are common after such operation, but eating small, frequent meals and drinking fluids between meals helps.</li>
<li>Reflux isn't usually a problem because of the way the stomach is positioned, even though we don't do an anti-reflux procedure.</li>
<li>Most people are back to normal activities about 6 weeks after surgery.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
